test_result/fio-3.28-4R5J0001-sr-1G-qd4-num1-128K-3000-WT.txt
fio-3.28-4R5J0001-read-1G-4-1-128K: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=4
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685886,
  "timestamp_ms" : 1750685886185,
  "time" : "Mon Jun 23 21:38:06 2025",
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-read-1G-4-1-128K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 2147483647,
      "elapsed" : 2,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-read-1G-4-1-128K",
        "filename" : "/dev/sda",
        "rw" : "read",
        "bs" : "128K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "4",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 1123160903,
        "bw" : 1096836,
        "iops" : 8569.037657,
        "runtime" : 956,
        "total_ios" : 8192,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 6360,
          "max" : 117644,
          "mean" : 24287.146484,
          "stddev" : 12492.291439,
          "N" : 8192
        },
        "clat_ns" : {
          "min" : 200548,
          "max" : 807690,
          "mean" : 439136.168823,
          "stddev" : 65636.328175,
          "N" : 8192,
          "percentile" : {
            "1.000000" : 288768,
            "5.000000" : 325632,
            "10.000000" : 350208,
            "20.000000" : 391168,
            "30.000000" : 415744,
            "40.000000" : 444416,
            "50.000000" : 444416,
            "60.000000" : 444416,
            "70.000000" : 444416,
            "80.000000" : 468992,
            "90.000000" : 536576,
            "95.000000" : 552960,
            "99.000000" : 593920,
            "99.500000" : 651264,
            "99.900000" : 692224,
            "99.950000" : 733184,
            "99.990000" : 806912
          },
          "bins" : {
            "199680" : 1,
            "220160" : 1,
            "224256" : 1,
            "226304" : 2,
            "234496" : 2,
            "238592" : 1,
            "257024" : 1,
            "259072" : 2,
            "261120" : 1,
            "264192" : 2,
            "268288" : 2,
            "272384" : 2,
            "276480" : 6,
            "280576" : 14,
            "284672" : 18,
            "288768" : 36,
            "292864" : 38,
            "296960" : 42,
            "301056" : 29,
            "305152" : 41,
            "309248" : 31,
            "313344" : 26,
            "317440" : 23,
            "321536" : 28,
            "325632" : 72,
            "329728" : 119,
            "333824" : 74,
            "337920" : 60,
            "342016" : 64,
            "346112" : 74,
            "350208" : 76,
            "354304" : 76,
            "358400" : 45,
            "362496" : 41,
            "366592" : 78,
            "370688" : 141,
            "374784" : 84,
            "378880" : 64,
            "382976" : 79,
            "387072" : 89,
            "391168" : 96,
            "395264" : 99,
            "399360" : 120,
            "403456" : 169,
            "407552" : 166,
            "411648" : 160,
            "415744" : 108,
            "419840" : 67,
            "423936" : 58,
            "428032" : 72,
            "432128" : 82,
            "436224" : 83,
            "440320" : 98,
            "444416" : 2942,
            "448512" : 246,
            "452608" : 73,
            "456704" : 149,
            "460800" : 65,
            "464896" : 70,
            "468992" : 50,
            "473088" : 39,
            "477184" : 16,
            "481280" : 33,
            "485376" : 33,
            "489472" : 26,
            "493568" : 55,
            "497664" : 66,
            "501760" : 60,
            "505856" : 56,
            "509952" : 60,
            "514048" : 69,
            "518144" : 44,
            "522240" : 79,
            "528384" : 124,
            "536576" : 163,
            "544768" : 197,
            "552960" : 117,
            "561152" : 129,
            "569344" : 116,
            "577536" : 51,
            "585728" : 17,
            "593920" : 9,
            "602112" : 2,
            "610304" : 11,
            "618496" : 6,
            "626688" : 9,
            "634880" : 3,
            "643072" : 2,
            "651264" : 9,
            "659456" : 6,
            "667648" : 6,
            "675840" : 7,
            "684032" : 4,
            "692224" : 2,
            "700416" : 1,
            "708608" : 1,
            "733184" : 1,
            "749568" : 1,
            "765952" : 1,
            "798720" : 1,
            "806912" : 1
          }
        },
        "lat_ns" : {
          "min" : 250822,
          "max" : 827317,
          "mean" : 463816.413086,
          "stddev" : 59310.988808,
          "N" : 8192
        },
        "bw_min" : 1097472,
        "bw_max" : 1097472,
        "bw_agg" : 100.000000,
        "bw_mean" : 1097472.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 1,
        "iops_min" : 8574,
        "iops_max" : 8574,
        "iops_mean" : 8574.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 1
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 955,
      "usr_cpu" : 6.073298,
      "sys_cpu" : 30.785340,
      "ctx" : 6643,
      "majf" : 0,
      "minf" : 140,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 99.963379,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.097656,
        "500" : 83.300781,
        "750" : 16.564941,
        "1000" : 0.036621
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 4,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 7565,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 3226,
      "write_ticks" : 0,
      "in_queue" : 3226,
      "util" : 89.928789
    }
  ]
}

fio-3.28-4R5J0001-read-1G-4-1-128K: (groupid=0, jobs=1): err= 0: pid=83240: Mon Jun 23 21:38:06 2025
  read: IOPS=8569, BW=1071MiB/s (1123MB/s)(1024MiB/956msec)
    slat (usec): min=6, max=117, avg=24.29, stdev=12.49
    clat (usec): min=200, max=807, avg=439.14, stdev=65.64
     lat (usec): min=250, max=827, avg=463.82, stdev=59.31
    clat percentiles (usec):
     |  1.00th=[  289],  5.00th=[  326], 10.00th=[  351], 20.00th=[  392],
     | 30.00th=[  416], 40.00th=[  445], 50.00th=[  445], 60.00th=[  445],
     | 70.00th=[  445], 80.00th=[  469], 90.00th=[  537], 95.00th=[  553],
     | 99.00th=[  594], 99.50th=[  652], 99.90th=[  693], 99.95th=[  734],
     | 99.99th=[  807]
   bw (  MiB/s): min= 1071, max= 1071, per=100.00%, avg=1071.75, stdev= 0.00, samples=1
   iops        : min= 8574, max= 8574, avg=8574.00, stdev= 0.00, samples=1
  lat (usec)   : 250=0.10%, 500=83.30%, 750=16.56%, 1000=0.04%
  cpu          : usr=6.07%, sys=30.79%, ctx=6643, majf=0, minf=140
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=8192,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=1071MiB/s (1123MB/s), 1071MiB/s-1071MiB/s (1123MB/s-1123MB/s), io=1024MiB (1074MB), run=956-956msec

Disk stats (read/write):
  sda: ios=7565/0, merge=0/0, ticks=3226/0, in_queue=3226, util=89.93%